artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 5
      arrivalRate: 3000
scenarios:
  - name: "App endpoints"
    flow:
      - post:
          url: "/rides"
          json:
            startLatitude: 89
            startLongitude: 170
            endLatitude: 20
            endLongitude: 178
            riderName: "george"
            driverName: "george"
            driverVehicle: "m3"
      - get:
          url: "/rides/1"
      - get:
          url: "/health"